#include <iostream>
#include <cstring> // Для функции strcat
#include <string>
#include <windows.h>

using namespace std;

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    setlocale(LC_ALL, "");
    setlocale(LC_ALL, "Russian");
    const int MAX_LENGTH = 1000; // Максимальная длина строки

    char A[MAX_LENGTH]; // Строка A
    char B[] = " проще, чем бросить курить – я сам проделывал это уже сотни раз."; // Строка B
    char C[] = "Марк Твен - известный американский писатель."; // Строка C

    // Ввод строки A с клавиатуры
    cout << "Введите строку A: ";
    cin.getline(A, MAX_LENGTH);

    // Вычисление количества символов в строке A
    int lengthA = strlen(A);

    // Вывод строки A и количества символов в ней
    cout << "Строка A: " << A << endl;
    cout << "Количество символов в строке A: " << lengthA << endl;

    // Добавление строки B к строке A
    strcat(A, B);

    // Вычисление количества символов в строке A после добавления B
    lengthA = strlen(A);

    // Вывод строки A и количества символов в ней после добавления B
    cout << "Строка A после добавления B: " << A << endl;
    cout << "Количество символов в строке A после добавления B: " << lengthA << endl;

    // Добавление 10 символов строки C к строке A
    strncat(A, C, 100);

    // Вывод строки A и количества символов в ней после добавления 10 символов строки C
    lengthA = strlen(A);

    // Вывод строки A и количества символов в ней после добавления 10 символов строки C
    cout << "Строка A после добавления 10 символов строки C: " << A << endl;
    cout << "Количество символов в строке A после добавления 10 символов строки C: " << lengthA << endl;

    return 0;
}
