#include <iostream>
#include <cstring> // Для функции strcpy

using namespace std;

int main() {
    const int MAX_LENGTH = 1000; // Максимальная длина строки

    char A[MAX_LENGTH]; // Строка A
    char B[MAX_LENGTH]; // Строка B

    char str1[] = "Лондон стоит посетить только за то, что это родина Шерлока Холмса."; // Строка 1
    char str2[] = "Москва - столица России"; // Строка 2
    char str3[] = "Мы жили в Великобритании"; // Строка 3

    // Копирование "Лондон" из строки 1 в строку A
    strcpy(A, "Лондон");

    // Копирование "столица Великобритании" из строки 2 в строку B
    strcpy(B, "столица Великобритании");

    // Вывод результата
    cout << "Результат: " << A << " - " << B << endl;

    return 0;
}
